modules/idaithalam/src/test/resources/Excels/request_xml.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope
        xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Body>
        <CelsiusToFahrenheit xmlns="https://www.w3schools.com/xml/">
            <Celsius>100</Celsius>
        </CelsiusToFahrenheit>
    </soap:Body>
</soap:Envelope>