SOAPRequests/FahrenheitToCelsuisRequest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:gs="https://www.w3schools.com/xml/">
    <soapenv:Header/>
    <soapenv:Body>
        <gs:FahrenheitToCelsius>
            <gs:Fahrenheit>190</gs:Fahrenheit>
        </gs:FahrenheitToCelsius>
    </soapenv:Body>
</soapenv:Envelope> 